const Map<String, Map<String, List<String>>> lessonsByGrade = {
  'الأول الابتدائي': {
    'الرياضيات': [
      'الفصل الأول: الأنماط والأعداد حتى 20',
      'الفصل الثاني: مقارنة الأعداد وترتيبها',
      'الفصل الثالث: الجمع والطرح حتى 10',
      'الفصل الرابع: التصنيف والتمثيل بمخططات الصور',
      'الفصل الخامس: الجمع حتى 20',
      'الفصل السادس: الطرح حتى 20',
      'الفصل السابع: الهندسة والقياس',
      'الفصل الثامن: الأعداد حتى 99 والقيمة المكانية',
      'الفصل التاسع: الجمع والطرح حتى 99 دون إعادة تسمية',
    ],
  },
};