const Map<String, List<String>> subjectsByGrade = {
  'الأول الابتدائي': [
    'التربية الإسلامية',
    'القراءة',
    'الرياضيات',
    'العلوم',
    'اللغة الإنكليزية',
    'التربية الأخلاقية',
  ],

  'الثاني الابتدائي': [
    'التربية الإسلامية',
    'القراءة',
    'الرياضيات',
    'العلوم',
    'اللغة الإنكليزية',
    'التربية الأخلاقية',
  ],

  'الثالث الابتدائي': [
    'التربية الإسلامية',
    'القراءة',
    'الرياضيات',
    'العلوم',
    'اللغة الإنكليزية',
  ],

  'الرابع الابتدائي': [
    'التربية الإسلامية',
    'القراءة',
    'القواعد',
    'الرياضيات',
    'العلوم',
    'اللغة الإنكليزية',
    'الاجتماعيات',
  ],

  'الخامس الابتدائي': [
    'التربية الإسلامية',
    'القراءة',
    'القواعد',
    'الرياضيات',
    'العلوم',
    'اللغة الإنكليزية',
    'الاجتماعيات',
  ],

  'السادس الابتدائي': [
    'التربية الإسلامية',
    'القراءة',
    'القواعد',
    'الرياضيات',
    'العلوم',
    'اللغة الإنكليزية',
    'الاجتماعيات',
  ],

  'الأول المتوسط': [
    'التربية الإسلامية',
    'اللغة العربية',
    'اللغة الإنكليزية',
    'اللغة الفرنسية',
    'الرياضيات',
    'الاجتماعيات',
    'الأحياء',
    'الكيمياء',
    'الفيزياء',
    'الحاسوب',
    'التربية الأخلاقية',
  ],

  'الثاني المتوسط': [
    'التربية الإسلامية',
    'اللغة العربية',
    'اللغة الإنكليزية',
    'اللغة الفرنسية',
    'الرياضيات',
    'الاجتماعيات',
    'الأحياء',
    'الكيمياء',
    'الفيزياء',
    'الحاسوب',
    'التربية الأخلاقية',
  ],

  'الثالث المتوسط': [
    'التربية الإسلامية',
    'اللغة العربية',
    'اللغة الإنكليزية',
    'اللغة الفرنسية',
    'الرياضيات',
    'الاجتماعيات',
    'الأحياء',
    'الكيمياء',
    'الفيزياء',
  ],
};